Repository: RyanHolanda/Restaurant_app
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# language
source: English
es: Spanish
pt: Brazilian Portuguese

source: Your favorite hamburguer
es: tu hamburguesa favorita
pt: O Seu Hambúrger Preferido

source: Get Started
es: Empezar
pt: Começar

source: I Already have an account
es: Ya tengo una cuenta
pt: Eu já tenho uma conta

source: Welcome
es: ¡Bienvenido!
pt: Bem-vindo

source: Insert your E-mail to create your account
es: Inserta tu correo electrónico para crear tu cuenta
pt: Insira seu E-mail para criar sua conta

# insertYourEmailtoRecoverYourPassword
source: Insert the E-mail that you used to create your account, to recover your Password
es: Inserta el correo electrónico que utilizó para crear su cuenta para recuperar tu contraseña
pt: Insira o E-mail que usou para criar sua conta, para recuperar sua senha

# insertYourEmailandPasswordtoLogin
source: Enter you E-mail and Password to login
es: Inserte su correo electrónico y contraseña para iniciar sesión
pt: Insira seu E-mail e sua senha para entrar

source: Create a password
es: Crear una contraseña
pt: Crie uma senha

source: Invalid E-mail
es: Email inválido
pt: E-mail inválido

source: Invalid Password
es: Contraseña invalida
pt: Senha inválida

# invalidPasswordRegister
source: Invalid Password. Insert at least 6 characters
es: Contraseña invalida. Inserta al menos 6 caracteres
pt: Senha inválida. Insira ao menos 6 caracteres

# tooManyRequests
source: Too many attempts, try again later
es: demasiados intentos. Vuelva a intentarlo más tarde
pt: Muitas tentativas, tente novamente mais tarde

# weakPassword
source: Weak password. Please choose a stronger password consisting of more characters
es: Contraseña debil. ¡Elija una contraseña más segura que contenga más caracteres!
pt: Senha muito curta, use no mínimo 6 caracteres

# noCurrentUser
source: No current user with this information was found
es: No se encontró ningún usuario actual con esta información
pt: Não foi encontrado um usuário com Este E-mail e senha

# unknownError
source: Unknown authentication error. Try again later
es: Error desconocido. Vuelva a intentarlo más tarde
pt: Erro desconhecido. Tente novamente mais tarde

# emailAlreadyExists
source: Email already exists. Please choose another email to register with
es: El Email ya existe. Elija otro correo electrónico para registrarse
pt: Esse e-mail já está registrado, utilize outro E-mail.

source: Almost done...
es: Casi listo...
pt: Quase lá...

source: Delivery
es: Entrega

source: Most ordered
es: Más pedidos
pt: Mais pedidos

source: Payment Method
es: Método de pago
pt: Forma de pagamento

source: Shipping Adress
es: Dirección de Envío
pt: Endereço de entrega

source: Add a name
es: Agregar un nombre
pt: Adicione um nome

source: Name And Middle Name
es: Nombre y Apellido
pt: Nome e sobrenome

source: Pick up
es: Recoger
pt: Retirar

# unavailableItem
source: Sorry, this item is unavailable now! ðŸ˜”
es: Lo sentimos, ¡este artículo no está disponible ahora! 😔
pt: Desculpe, esse item não está disponível agora! 😔

# itemAddedtoCart
source: Item added to cart! ðŸ˜€
es: ¡Artículo agregado al carrito! 😀
pt: Item adicionado ao carrinho! 😀

# addAnAdress
source: Add an Address
es: Agregar una dirección
pt: Adicionar endereço

source: Enter an address
es: introduce una direccíon
pt: Procure um endereço

source: Add a complement
es: agregar un complemento
pt: Adicionar complemento

source: Number
es: Número
pt: Número

source: Debit Card
es: Tarjeta de débito
pt: Cartão de débito

source: Pay on App
es: Pagar en la aplicación
pt: Pagar no App

source: Pay on delivery
es: Pagar cuando reciba
pt: Pagar na entrega

source: Cash
es: Dinero
pt: Dinheiro

source: Finish my order
es: Terminar mi pedido
pt: Finalizar meu pedido

source: Would you like sachets of ketchup and mustard?
es: ¿Quieres bolsitas de ketchup y mostaza?
pt: Gostaria de sachês de ketchup e mostarda?

source: What do you prefer?
es: ¿Qué prefieres?
pt: Pefere qual acompanhamento?

source: No, Thanks!
es: ¡No, gracias!
pt: Não, Obrigado!

source: Credit Card
es: Tarjeta de crédito
pt: Cartão de crédito

source: Complement
es: El complemento
pt: Complemento

source: Save Address
es: Guardar dirección
pt: Salvar endereço

source: Reference
es: Referencia
pt: Referência

source: Add a number
es: Agregar un número
pt: Adicione um número

source: You need to select all options!
es: ¡Tienes que seleccionar todas las opciones!
pt: Você precisa selecionar todas opções!

# continuee
source: Continue
es: Continuar
pt: Continuar

source: Address not supported :(
es: Dirección no admitida :(
pt: Endereço não suportado :(

source: Cart
es: El Carrito
pt: Carrinho

source: No observations
es: Sin observaciones
pt: Sem observações

source: Shipping:
es: Transporte:
pt: Frete:

source: Your cart is empty :(
es: Tu carrito esta vacío :(
pt: Seu carrinho está vazio :(

source: Home
es: Comienzo
pt: Início

source: Yes
es: Sí
pt: Sim

source: Log Out
es: Cerrar sesión
pt: Encerrar sessão

source: Are you sure you want to log out?
es: ¿Estás seguro de que quieres cerrar sesión?
pt: Tem certeza que deseja encerrar sessão?

source: Orders
es: Pedidos
pt: Pedidos

source: You don't have orders :(
es: No tienes pedidos :(
pt: Você não tem pedidos :(

# youDontHaveOrdersDescription
source: You still don't have orders, please order a Burger!!
es: ¡Aún no tienes pedidos, por favor pide una hamburguesa!
pt: Você ainda não pediu, Que tal um Hambúguer? Peça agora!!

source: Profile
es: Perfil
pt: Perfil

source: Add a few items in your cart
es: ¡Agregue algunos artículos en su carrito!
pt: Adicione alguns items no seu carrinho

# weCantDeliver
source: Sorry, we can't deliver our products to you, we only can deliver produts to address in 10km radius
es: Lo sentimos, todavía no podemos realizar entregas en su área. Nuestra área de entrega es solo por 10km
pt: Desculpe, ainda não podemos entregar na sua região. Nossa área de entrega é apenas para 10km

# pickUpAdress
source: Pick up address
es: dirección para recoger
pt: Endereço de retirada

source: Receive your order in 30m - 1h
es: Recibe tu pedido en 30m - 1h
pt: Receba seu pedido em 30m - 1h

source: Receive your order in 1h - 2h
es: Recibe tu pedido en 1h - 2h
pt: Receba seu pedido em 1h - 2h

source: We need your Phone number to create your account
es: Necesitamos su número de teléfono para crear su cuenta
pt: Precisamos do seu Número de celular para criar sua conta

source: Invalid Phone number
es: Numero de telefono invalido
pt: Número de telefone inválido

source: E-mail sucessfully sent
es: Correo electrónico enviado con éxito
pt: E-mail enviado com sucesso

# emailSucessfullySentDialogContent
source: We sent you an Email With a link to reset your Password. if you don't found, check spam section. if isn't there, you can send another Email clicking again in send Email
es: Le enviamos un correo electrónico con un enlace para restablecer su contraseña. si no encuentras revisa la sección de spam. si no está allí, puede enviar otro correo electrónico haciendo clic nuevamente en enviar correo electrónico
pt: Enviamos um e-mail com um link para redefinir sua senha. se você não encontrar verifique a seção de spam. se não estiver lá, você pode enviar outro Email clicando novamente em enviar Email

source: Recover password
es: Recuperar contraseña
pt: Recuperar senha

source: Add a note!
es: Agregar nota!
pt: Adicione uma observação!

source: Well done!
es: ¡Bien cocido!
pt: Bem passada!

# generatingYourPIX
source: Generating your PIX key...
es: Generando su clave PIX...
pt: Gerando sua chave PIX...

source: Pay in
es: Pagar en
pt: Pagar no

# orderApproved
source: Uhuuuul! Order approved
es: ¡Uhuuuul! Orden aprobada
pt: Uhuuuul! Pedido aprovado

source: Completed
es: Terminado

source: Cooking
es: Cocinando

# finishedCook
source: Your order is ready
es: Tu pedido esta listo

source: In delivery
es: En la entrega

source: Status
es: Estado

source: Value
es: Valor

# pixKey
source: Your PIX key
es: Tu clave PIX

# minimumOrderPrice
source: Sorry, we only accept orders above R$20,00
es: Lo sentimos, solo aceptamos pedidos superiores a R$ 20,00

# weAreClosed
source: Sorry, we are closed right now, but when we open you can order!
es: Lo sentimos, estamos cerrados en este momento, pero cuando abramos puedes ordenar!

# dontCloseApp
source: Don't close the app before or few seconds after do the payment! or your payment don't gonna be accepted
es: ¡No cierre la aplicación antes o unos segundos después de realizar el pago! o su pago no será aceptado

# orderApprovedText
source: Your order was sent to production, in a few minutes you gonna have it in your hands!
es: ¡Tu pedido fue enviado a producción, en unos minutos lo tendrás en tus manos!
pt: Seu pedido foi enviado á produção, em alguns minutos você terá seu pedido em suas mãos!

source: Recipient:
es: Destinatario:
pt: Destinatário:

source: Institution:
es: Institución:
pt: Instituição:

source: Amount:
es: La cantidad:
pt: Valor:

# copyAndPastePix
source: PIX Copy and paste
es: PIX Copiar y pegar
pt: PIX Copia e cola

source: Pending payment
es: Pago pendiente
pt: Pagamento pendente

source: Copied to clipboard
es: Copiado al portapapeles
pt: Copiado para área de transferência

source: Confirm my order
es: Confirmar mi pedido
pt: Confirmar meu pedido

# orderReceived
source: The restaurant received your order
es: El restaurante recibió tu pedido.

source: How much gonna pay?
es: ¿Cuánto vas a pagar?

# ifYouNeedChangeWeGonnaPayinPix
source: If you need change, we gonna pay to you in PIX, plase insert your PIX Key below!
es: Si necesita vuelto, le pagaremos en PIX, ¡inserte su clave PIX abajo!

source: You need to fill all informations!
es: ¡Necesitas completar toda la información!
pt: Você precisa preencher todas as informações!

source: Add
es: Agregar
pt: Adicionar

source: Medium!
es: ¡A punto!
pt: Ao ponto!

# howWouldYouLikeYourSteak
source: How would you like your meat?
es: ¿Cómo te gustaría tu carne?
pt: Como você gosta da carne?

source: Menu
es: Menú
pt: Cardápio

source: Send E-mail
es: Enviar correo electrónico
pt: Enviar E-mail

source: E-mail
es: Correo electrónico

source: Password
es: Contraseña
pt: Senha

# signupWithGoogle
source: Register with Google
es: Regístrese con Google
pt: Registrar com Google

source: Sign in with Google
es: Iniciar sesión con Google
pt: Entrar com Google

source: Sign in
es: Iniciar sesión
pt: Entrar

# forgotMyPassword
source: I forgot my password
es: Olvidé mi contraseña
pt: Esqueci minha senha

source: Or
es: Otro
pt: Outro

source: Hello!
es: ¡Hola!
pt: Olá!

source: No
pt: Não
